In [1]:
import pandas as pd

In [2]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['age', [28,27,29]],
        ['job', ['student', 'programmer','master']]
]

df = pd.DataFrame.from_items(friends)
df

   name  age         job
0  beom   28     student
1  seek   27  programmer
2   wan   29      master

In [3]:
df[:2]

   name  age         job
0  beom   28     student
1  seek   27  programmer

index location

In [4]:
df.loc[[0,2]]

   name  age      job
0  beom   28  student
2   wan   29   master

## 조건에 따른 속성 값 얻기

In [5]:
df[df.age>28]

  name  age     job
2  wan   29  master

In [6]:
df.query('age > 28')

  name  age     job
2  wan   29  master

논리적 조건사용

In [7]:
df[(df.name == 'wan') | (df.age > 27)]

   name  age      job
0  beom   28  student
2   wan   29   master

## Column을 필터하기

In [8]:
friends_list = [
    ['beom', 28, 'student'],
    ['seek',27,'programmer'],
    ['wan', 29,'master']
]

In [9]:
#df = pd.DataFrame(friends_list, columns = ['name', 'age', 'job'])
df = pd.DataFrame(friends_list)
df

      0   1           2
0  beom  28     student
1  seek  27  programmer
2   wan  29      master

iloc[row, col]

In [10]:
df.iloc[:,:2]

      0   1
0  beom  28
1  seek  27
2   wan  29

## column name을 사용하여 사용

In [11]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

In [12]:
df[['name', 'job']]

   name      job
0  beom  student
1  seek  default
2   wan   master

filter 기능 사용

In [13]:
df.filter(items = ['age', 'job'])

   age      job
0   28  student
1   27  default
2   28   master

In [14]:
df.filter(like = 'a', axis = 1) # column이름에 'a'가 들어간 것만 선택

   name  age
0  beom   28
1  seek   27
2   wan   28

In [15]:
df.filter(regex = 'e$', axis = 1) # column이름이 'e'로 끝나는 것만 선택

   name  age
0  beom   28
1  seek   27
2   wan   28

## 행렬 삭제 Drop row or column

index number로 drop

In [16]:
df.drop(1)

   name  age      job
0  beom   28  student
2   wan   28   master

하지만 df자체는 변하지 않는다.

In [17]:
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

In [18]:
df = df.drop(['job'],axis=1) # axis = 1 이라는 의미는 column중에서 라는 의미
df

   name  age
0  beom   28
1  seek   27
2   wan   28

In [19]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

inplace를 True로 설정한다면 바로 적용이 된다.

In [20]:
df.drop(['job'],axis=1, inplace = True)
df

   name  age
0  beom   28
1  seek   27
2   wan   28

In [21]:
df.drop(1, inplace = True)
df

   name  age
0  beom   28
2   wan   28

In [22]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

## 행렬 수정하기

In [23]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['age', [28,27,29]],
        ['job', ['student', 'programmer','master']]
]

df = pd.DataFrame.from_items(friends)
df

   name  age         job
0  beom   28     student
1  seek   27  programmer
2   wan   29      master

In [24]:
df['salary'] = 0

In [25]:
df

   name  age         job  salary
0  beom   28     student       0
1  seek   27  programmer       0
2   wan   29      master       0

In [26]:
import numpy as np

In [27]:
df['salary'] = np.where(df['job']!='student', 'yes', 'no')
df

   name  age         job salary
0  beom   28     student     no
1  seek   27  programmer    yes
2   wan   29      master    yes

In [28]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['mid', [70,75,90]],
        ['final', [80, 75, 95]]
]

df = pd.DataFrame.from_items(friends)
df

   name  mid  final
0  beom   70     80
1  seek   75     75
2   wan   90     95

In [29]:
df['total'] = df['mid'] + df['final']
df

   name  mid  final  total
0  beom   70     80    150
1  seek   75     75    150
2   wan   90     95    185

In [30]:
df['avg'] = df['total'] /2
df

   name  mid  final  total   avg
0  beom   70     80    150  75.0
1  seek   75     75    150  75.0
2   wan   90     95    185  92.5

In [31]:
grades = []

for row  in df['avg']:
    if row >= 90:
        grades.append('A')
    else:
        grades.append('F')
        
df['grades'] = grades
df

   name  mid  final  total   avg grades
0  beom   70     80    150  75.0      F
1  seek   75     75    150  75.0      F
2   wan   90     95    185  92.5      A

## DataFrame의 apply함수 사용

In [32]:
def pass_or_unpass(row):
    if row!= 'F':
        return 'Pass'
    else:
        return 'Unpass'

In [33]:
df['grade'] = df.grades.apply(pass_or_unpass)
df.head()

   name  mid  final  total   avg grades   grade
0  beom   70     80    150  75.0      F  Unpass
1  seek   75     75    150  75.0      F  Unpass
2   wan   90     95    185  92.5      A    Pass

In [36]:
date_list = [
    {
        'yyyy-mm-dd' : '2017-09-26'
    },
    {
        'yyyy-mm-dd' : '2018-09-26'
    }
]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2017-09-26
1  2018-09-26

In [37]:
def get_month(row):
    return row.split('-')[1]

In [38]:
df['month'] = df['yyyy-mm-dd'].apply(get_month)
df

   yyyy-mm-dd month
0  2017-09-26    09
1  2018-09-26    09

행 추가하기

In [49]:
df_add = pd.DataFrame([['2019-10-26', 10]], columns = ['yyyy-mm-dd', 'month'])
df_add

   yyyy-mm-dd  month
0  2019-10-26     10

In [50]:
df.append(df_add, ignore_index = True)

   yyyy-mm-dd month
0  2017-09-26    09
1  2018-09-26    09
2  2019-10-26    10